{"pages":[{"title":"about","text":"研究や趣味についてのブログです。","link":"/hotakahattori.github.io/about/index.html"}],"posts":[{"title":"自己紹介","text":"はじめまして，服部と申します。 ブログを開設してみました。 日々買ったものや勉強したことを紹介していければなと思います。 初めての投稿なので，簡単に自己紹介をしたいと思います。 経歴 研究 趣味 おわりに 経歴基本的に東京育ちですが，出身は大阪です。父の仕事の関係で2〜3年，福岡にいたこともあります。 中学と高校は，都内の麻布という私立の学校に通っていました。 勉強はあまりできる方ではなく，一年浪人した末に東京工業大学の第四類に入学しました。 機械系の道に進む予定でしたが，大きく気が変わり，現在は工学院の経営工学系というところで修士一年生をやっています。 研究今現在，数理最適化，オペレーションズ・リサーチという分野の研究をしています。 簡単に言うと，世の中にはびこる諸問題を，数学を用いて解決しようという学問です。 対象としている問題は幅広いですが，僕は主に輸送問題やスケジューリング問題に取り組んでいます。 もともと数学は得意ではなかったので，全然違う分野の研究室を志望していましたが，成績が死ぬほど悪く，第14志望の研究室への配属になってしまいました。 結果，苦手な数学と向き合い，研究する羽目になっております（結果的には良かったと思っています）。 趣味ガジェット集めが趣味で，色々買い漁っています。後悔も多いです…。 カメラもやってたりやってなかったりします。最近は撮りに行けてないですが，以前は三脚を担いで夜景を撮りに行ったりしていました。 中高とバドミントン部だったので，誘われればバドミントンもたまにやります。 おわりになるべく更新頻度多めに，面白いものや情報を発信していけたらなと思います。 どうぞよろしくお願い致します。","link":"/hotakahattori.github.io/2020/06/27/%E8%87%AA%E5%B7%B1%E7%B4%B9%E4%BB%8B/"},{"title":"LGの4K対応27インチモニターを買った話","text":"二ヶ月ほど前になりますが，大学の授業が全てオンライン化することが決定したのを機に，モニターを買ってみました！ モニターを買うのは初めてで，どれにするか結構悩みましたが，LGの4K対応27インチモニター27UL850-Wという製品を購入することにしました。 値段はかなりしましたが，結論としては非常に満足のいく買い物ができたと思っております。 モニターは買いたいけど，どれを選べばよいか悩んでいるあなた！！ LG最高ですよ〜 このモニターを選んだ決め手 1. MacBookとの兼ね合い 2. ケーブル問題 買ってから後悔したくない スペック 外観 可動域 拡張性 まとめ このモニターを選んだ決め手スペック紹介の前に，このモニターを選ぶ決め手になった部分について紹介します。 実はこのモニター，はっきり言ってクソ高いです。 27インチのモニターを最も安く買おうとすると，2万円でお釣りが来てしまいますが，このモニターはなんと6万円もします。 なぜこんなに高いものを敢えて買ったのかというと，理由は主に以下の３つです。 MacBookとの兼ね合いで液晶は4Kで揃えたかった 机の上がケーブルでごちゃごちゃするのが嫌だ 買ってから後悔したくない 1. MacBookとの兼ね合いこれまで僕は，私用のモニターは持っていませんでしたが，研究室等で自分のPC（MacBook）をモニターに繋いで作業する機会は多々ありました。 うちの研究室はモニターにお金をかける文化があまりないので，基本的に置いてあるのは安いモニターです。 よって画質もイマイチなのです。\b 対する僕が所有しているMacBookはRetinaディスプレイ搭載モデル。美しいんですよ，液晶が（笑） こうなってくると，やはり横に並べたときの画質の落差が気になるんですよね〜（気にならない人は気にならないと思いますが） しかも安いモニターって，せっかく大きな画面でプログラムとか書いてても，ドットが荒すぎて「見にくっ！！」てことありませんか？？ 卒論で少しコードを書いたりもしましたが，ドットの荒さが結構ストレスだったりしました。 YouTubeとか映画とかも，なるべく高画質で観たいですよね（笑） 僕はそういった理由から，モニターは4K対応のものにこだわりました。 2. ケーブル問題一般的なモニターにPCを繋げる場合，HDMIやディスプレイポートを用いた出力になるかと思います。 モニター出力って，PC側の電力も使うので，PCを給電しながらの出力が一般的かと思われます。 つまり，PCからモニターに映像を出力する場合，出力用と給電用の2本のケーブルをPCに差すことになります。 それって結構ダルくないですか？？ 僕の場合，家でも外出時でも同じノートPCを使っているため，持ち運ぶたびにケーブルを抜き差しする必要があります。 毎度毎度二本抜き差しするのって結構ストレスですよね… それにHDMIケーブルって結構太いし机の上にあると邪魔… ですがこのモニター，USB Type-Cケーブル一本で「出力」と「給電」が同時に行えるんです！！ すごくないですか！？ 僕のPCの場合，そもそもUSB Type-Cが2ポートしかないため，一本で出力と給電が完結するのはかなり嬉しいです。 しかもこのモニター，Power delivery対応（60Wまで）なので，給電スピードもかなり速いです。 買ってから後悔したくない皆さん，中途半端にけちって安いものを買って，後悔した経験ってありませんか？ 僕は本来欲しかったものより安いものを買ってしまったとき，その製品を疑いの目で見てしまうんですよね，ずっと… そのせいで，細かいところがどんどん気になってしまい，結局，本来欲しかったものを買い直してしまうという経験が多々あります…（気にならない人が羨ましいです） そうなった場合，最初に買った安いものって無駄になってしまうんですよね。 こうした経験から僕は，最初から，買える範囲で一番良いものを買うように心がけています。 高いものやブランド物って，それだけで何か安心しませんか？（笑） 変に疑いの目をかけなくなるというか… その点LGのモニターって，Apple公式オンラインストアにも売ってて（こっちのはもっとクソ高いです），Apple信者的にはかなり信頼できるブランドのように感じます。 今回は安心料だと思って，LGの高いモニターを買うことにしました。 スペック詳しいスペックはLGの公式サイトを御覧ください。 ここでは普段使っていく上で，気になりそうなポイントを画像で紹介したいと思います。 外観 外観はかなりシンプルで洗練されており，ベゼル（液晶の枠の黒い部分）もかなり細めです。27インチのIPS非光沢液晶を採用しており，ザ・今どきの液晶といった印象を受けます。 もちろん4K対応です。 僕の机はあまり広くないので27インチのものを選びましたが，机の広さに余裕がある場合（モニターとの距離を十分取れる場合）はなるべく大きいものを選んだほうがいいと思います。 作業スペースは広いに越したことはありませんからね。 可動域このモニターは高さ調節機能が備わっており，角度も調節できます。 高さは ここから ここまで。角度は ここから ここまで。 これだけ動けば高さや角度の問題で不都合が生じることはなさそうですね。 もちろん縦置きにも対応してます。 拡張性 このモニターは，画像のように USB Type-C × 1 DisplayPort × 1 HDMI × 2 USB 3.0 × 2 ヘッドホン(ステレオミニジャック) × 1 が差せるようになっています。普段使いする分には必要十分ですよね。 僕の場合，映像出力と給電にUSB Type-Cポートを使い，スマホの充電用にUSBポートを一つ使っています。 もう一個USBポートに何を差そうか迷い中… ちなみにこのモニター，スピーカーが内蔵されています。 が，音質はといいますと，お世辞にも良いとは言えません… 僕の場合，音はMacBookから出力するように設定しています。 2020年モデルのMacBook Proを使用していますが，音質はこちらの方が断然いいです。 まとめいかがだったでしょうか？ 実際にAmazonなどで検索すると，魅力的なモニターは山程あります。 僕は生粋のApple信者なのでLGの製品を選びましたが，DellやHPからも同価格帯で同じようなスペックのモニターが販売されており，こちらも人気なようです。 新型コロナウイルスの影響で，リモート授業や在宅勤務を余儀なくされている方，多いかと思います。 自宅でPCを使った作業をする際，モニターを導入することで，思ったよりもはるかに作業効率は上がります。 これを期に，ご自宅の作業机に4Kモニターを導入してみてはいかがですか？","link":"/hotakahattori.github.io/2020/06/29/LG_monitor/"},{"title":"七田式で幼児教育を受けていました","text":"皆さん，幼児教育ってご存知ですか？ ご存知ですか？と言いつつ僕も何なのかイマイチよく分かっていませんが，要するに「幼少期からお勉強しましょうね」という英才教育の一種です。 実は僕，小学校に入学する前くらいまで，七田式という幼児教育教室で英才教育を受けて育ちました（笑） 今日は幼少期に七田式で経験した奇妙な体験についてお話したいと思います。 幼児教育って具体的に何をしてたの？ 漢字・計算 都道府県や円周率の暗記 積み木 フラッシュ暗算 幼少教育の効果 奇妙な体験 やめました 幼児教育って具体的に何をしてたの？幼少教育ってどういうことをしてたの？と思われる方向けに，実際に僕が当時何をしていたのか簡単にご紹介したいと思います。 七田式の教育は「右脳を鍛える」がテーマらしく，基本的にやっていたのは右脳の力を伸ばす教育だったらしいです。 かなり記憶が曖昧ですが，頑張って思い出します。 漢字・計算漢字ドリルや百ます計算は嫌というほどやらされた記憶があります。 これは教室ではなく，家でやらされてやらせていただいていました。 大量の問題集が与えられ，親から1日にやる分量が課せられていました。 当然こなせるはずもなく，溜めては怒られ，泣きながらやらされてました。 これが一番苦行だったかな… 都道府県や円周率の暗記47都道府県や県庁所在地，円周率の暗記もさせられました。 都道府県は歌で覚えて，円周率は語呂合わせで覚えていました。 基本的には家で覚えてきて教室で発表だった気がします。 円周率に関しては，当時500桁まで暗記して書いて見せていたらしいです（今現在，3.141592までしか言えません）。 積み木積み木もやっていました。 しかし，ただ木を積み上げて，何らかのオブジェクトを作成するいわゆる積み木遊びではありませんでした。 複雑に積まれた積み木が描かれた紙をパット見て，全部で何個積まれているかを答える，みたいなことをひたすらやっていました。 これはまぁまぁ楽しかったです。 フラッシュ暗算これもかなりやりました。 次々に数字を見せられて，全部の和を答えろ，みたいなやつです。 無数の点が描かれた紙を一瞬見せられて，点は何個でしょう？みたいなのもやっていたような気がします。 今現在，暗算はとても苦手です。 幼少教育の効果僕は幼児教育ついては割と肯定的です。 効果があったかと言われたら，多少なりともあったと思います。 少なくとも小学生の間は勉強で苦労することはありませんでしたし，算数は抜群にできました。 特に図形の分野は得意で，空間認知能力は人よりも高かったと思います。 ですから七田はクソ，みたいなことを言うつもりは毛頭ありません。 幼児教育万歳！！ 奇妙な体験ですが一個だけ，未だに疑問が残る体験があります。 七田式をやめるきっかけにもなった出来事です。 ある日先生が，大量の一円玉を持ってきて，我々生徒たちにこう言いました。 先生「これを自分のおでこに，できるだけたくさんくっつけましょう」 僕はおでこにペタペタと3枚ほどくっつけて見せました。 僕「先生どうですか？」 先生「違う違う，縦に（直列に）くっつけなさい」 一瞬先生が何を言っているのか理解できませんでしたが，どうも，一枚くっつけたら二枚目は一枚目の上に重ねる形でくっつけなければならないようです。 （なるほど，そういうことか。上を向いておでこを水平に保つトレーニングなんだな？上向いても結構難しいな…） 僕は上を向いておでこに1円玉を直列に2〜3枚のせて見せました。 先生「違います，正面を向いてやりなさい」 僕「え，は？？？」 先生「右脳を最大限活性化させればできます，七田式の代表は7枚くっつけることができます」 （いやいや，何を言っているんだ先生…） さすがに小学校入学前の僕にも，先生がなかなかにクレイジーなことを言っているのはすぐに分かりました。 しかし教室内では，先生が絶対です。 ましてや生徒は全員小学校入学前の幼児，誰も反論しません。 先生が言っているのだからと，生徒全員一生懸命おでこに一円玉をくっつけて見せました。 今考えるとかなり異様な光景だったと思います。 もちろん教室内最高枚数は1枚でした。 やめましたこれを親に報告してからすぐに，僕は七田式をやめました。 他にも水泳などの習い事をしていて，それとの兼ね合いというのもありますが，やはりこの事件は親にとっても衝撃的だったようです。 ちなみに嘘だと思われる方，「七田式 一円玉」でググってみてください。 波動だの色々出てくるはずです。 僕は右脳力が足りず，一枚を皮脂でくっつけるのがやっとでした。 二枚以上くっついたという方，いらっしゃいましたらご報告お待ちしております。","link":"/hotakahattori.github.io/2020/07/03/%E4%B8%83%E7%94%B0%E5%BC%8F/"}],"tags":[{"name":"数学","slug":"数学","link":"/hotakahattori.github.io/tags/%E6%95%B0%E5%AD%A6/"},{"name":"ガジェット","slug":"ガジェット","link":"/hotakahattori.github.io/tags/%E3%82%AC%E3%82%B8%E3%82%A7%E3%83%83%E3%83%88/"},{"name":"雑談","slug":"雑談","link":"/hotakahattori.github.io/tags/%E9%9B%91%E8%AB%87/"},{"name":"教育","slug":"教育","link":"/hotakahattori.github.io/tags/%E6%95%99%E8%82%B2/"}],"categories":[{"name":"数学","slug":"数学","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/"},{"name":"ガジェット","slug":"ガジェット","link":"/hotakahattori.github.io/categories/%E3%82%AC%E3%82%B8%E3%82%A7%E3%83%83%E3%83%88/"},{"name":"数理最適化","slug":"数学/数理最適化","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/%E6%95%B0%E7%90%86%E6%9C%80%E9%81%A9%E5%8C%96/"},{"name":"オペレーションズ・リサーチ","slug":"数学/オペレーションズ・リサーチ","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/%E3%82%AA%E3%83%9A%E3%83%AC%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3%E3%82%BA%E3%83%BB%E3%83%AA%E3%82%B5%E3%83%BC%E3%83%81/"},{"name":"カメラ","slug":"カメラ","link":"/hotakahattori.github.io/categories/%E3%82%AB%E3%83%A1%E3%83%A9/"},{"name":"雑談","slug":"雑談","link":"/hotakahattori.github.io/categories/%E9%9B%91%E8%AB%87/"},{"name":"自己紹介","slug":"自己紹介","link":"/hotakahattori.github.io/categories/%E8%87%AA%E5%B7%B1%E7%B4%B9%E4%BB%8B/"}]}