{"pages":[{"title":"about","text":"研究や趣味についてのブログです。","link":"/hotakahattori.github.io/about/index.html"}],"posts":[{"title":"LGの4K27インチモニターを買った話","text":"二ヶ月ほど前になりますが，大学の授業が全てオンライン化することが決定したのを機に，モニターを買ってみました！ モニターを買うのは初めてで，どれにするか結構悩みましたが，LGの4K対応27インチモニター27UL850-Wという製品を購入することにしました。 値段はかなりしましたが，結論としては非常に満足のいく買い物ができたと思っております。 モニター買いたいけど，どれを選べばよいか迷ってるあなた！！ LG最高ですよ〜 このモニターにした決め手 1. MacBookとの兼ね合い 2. ケーブル問題 買って後悔したくない スペック 外観 可動域 拡張性 まとめ このモニターにした決め手スペック紹介の前に，このモニターを選ぶ決め手になった部分について紹介します。 実はこのモニター，27インチのものの中では，はっきり言ってクソ高いです。 27インチのモニターを最も安く買おうとすると，2万円でお釣りが来てしまいますが，このモニターはなんと6万円もします。 なぜこんなに高いものを敢えて買ったのかというと，理由は主に以下の３つです。 MacBookとの兼ね合いで液晶は4Kで揃えたかった 机の上がケーブルでごちゃごちゃするのが嫌だ 買って後悔したくない 1. MacBookとの兼ね合いこれまで僕は，私用のモニターは持っていませんでしたが，研究室等で自分のPC（MacBook）をモニターに繋いで作業する機会は多々ありました。 うちの研究室はモニターにお金をかける文化があまりないので，基本的に置いてあるのは安いモニターです。 よって画質もイマイチなのです。\b 対する僕が所有しているMacBookはRetinaディスプレイ搭載モデル。美しいんですよ，液晶が（笑） こうなってくると，やはり横に並べたときの画質の落差が気になるんですよね〜（気にならない人は気にならないと思いますが） しかも安いモニターって，せっかく大きな画面でプログラムとか書いてても，ドットが荒すぎて「見にくっ！」てことありませんか？？ 卒論で少しコードを書いたりもしましたが，ドットの荒さが結構ストレスだったりしました。 YouTubeとか映画とかも，なるべく高画質で観たいですよね。 僕はそういった理由から，モニターは4K対応のものにこだわりました。 2. ケーブル問題一般的なモニターにPCを繋げる場合，HDMIやディスプレイポートを用いた出力になるかと思います。 モニター出力って，PC側の電力も使うので，PC給電しながらの出力が一般的かと思われます。 つまり，PCからモニターに映像を出力する場合，出力用と給電用の2本のケーブルをPCに差すことになります。 それって結構ダルくないですか？？ 僕の場合，家でも外出時でも同じノートPCを使っているため，持ち運ぶたびにケーブルを抜き差しする必要があります。 毎度毎度二本抜き差しするのって結構ストレスですよね… それにHDMIケーブルって結構太いし机の上にあると邪魔… ですがこのモニター，USB Type-Cケーブル一本で「出力」と「給電」が同時に行えるんです！！ すごくないですか！？ 僕のPCの場合，そもそもUSB Type-Cが2ポートしかないため，一本で出力と給電が完結するのはかなり嬉しいです。 しかもこのモニター，Power delivery対応（60Wまで）なので，給電スピードもかなり速いです。 買って後悔したくない皆さん，中途半端にけちって安いものを買って，後悔した経験ってありませんか？ 僕は本来欲しかったものより安いものを買ってしまったとき，その製品を疑ってしまうんですよね，ずっと… そのせいで，細かいところがどんどん気になってしまい，結局，本来欲しかったものまで買ってしまうという経験が多々あります…（気にならない人が羨ましいです） そうなった場合，最初に買った安いものって無駄になってしまうんですよね。 こうした経験から僕は，最初から，買える範囲で一番良いものを買うように心がけています。 高いものやブランド物って，それだけで何か安心しませんか？（笑） 変に疑いの目をかけなくなるというか… その点LGのモニターって，Apple公式オンラインストアにも売ってて（こっちのはもっとクソ高いです），Apple信者的にはかなり信頼できるブランドのように感じます。 今回は安心料と思って，LGの高いモニターを買うことにしました。 スペック詳しいスペックはLGの公式サイトを御覧ください。 ここでは普段使っていく上で，気になりそうなポイントを画像で紹介したいと思います。 外観外観はかなりシンプルで洗練されており，ベゼル（液晶の枠の黒い部分）もかなり細めです。27インチのIPS非光沢液晶を採用しており，ザ・今どきの液晶といった印象を受けます。 もちろん4K対応です。 僕の机はあまり広くないので27インチのものを選びましたが，机の広さに余裕がある場合（モニターとの距離を十分取れる場合）はなるべく大きいものを選んだほうがいいと思います。 作業スペースは広いに越したことはありませんからね。 可動域このモニターは高さ調節機能が備わっており，角度も調節できます。 高さは ここから ここまで。角度は ここから ここまで。 これだけ動けば高さや角度の問題で不都合が生じることはなさそうですね。 もちろん縦置きにも対応してます。 拡張性 このモニターは，画像のように USB Type-C × 1 DisplayPort × 1 HDMI × 2 USB 3.0 × 2 ヘッドホン(ステレオミニジャック) × 1 が差せるようになっています。普段使いする分には必要十分ですよね。 僕の場合，映像出力と給電にUSB Type-Cポートを使い，スマホの充電用にUSBポートを一つ使っています。 もう一個USBポートに何を差そうか迷い中… ちなみにこのモニター，スピーカーが内蔵されています。が，音質はといいますと，お世辞にも良いとは言えません… 僕は音はMacBookから出力するように設定しています。 2020年モデルのMacBook Proを使用していますが，音はこちらの方が断然いいです。 まとめいかがだったでしょうか？ 実際にAmazonなどで検索すると，魅力的なモニターは山程あります。 僕は生粋のApple信者なのでLGの製品を選びましたが，DellやHPからも同価格帯で同じようなスペックのモニターが販売されており，こちらも人気なようです。 新型コロナウイルスの影響で，リモート授業や在宅勤務を余儀なくされている方，多いかと思います。 自宅でPCを使った作業をする際，モニターを導入することで，思ったよりもはるかに作業効率は上がります。 これを期に，自宅にもモニターを導入してみてはいかがですか？","link":"/hotakahattori.github.io/2020/06/29/LG-monitor/LG-monitor/"},{"title":"自己紹介","text":"はじめまして，服部と申します。 ブログを開設してみました。 日々買ったものや勉強したことを紹介していければなと思います。 初めての投稿なので，簡単に自己紹介をしたいと思います。 経歴 研究 趣味 おわりに 経歴基本的に東京育ちですが，出身は大阪です。父の仕事の関係で2〜3年，福岡にいたこともあります。 中学と高校は，都内の麻布という市立の学校に通っていました。 勉強はあまりできる方ではなく，一年浪人した末に東京工業大学の第四類に入学しました。 機械系の道に進む予定でしたが，大きく気が変わり，現在は工学院の経営工学系というところで修士一年生をやっています。 研究今現在，数理最適化，オペレーションズ・リサーチという分野の研究をしています。 簡単に言うと，世の中にはびこる諸問題を，数学を用いて解決しようという学問です。 対象としている問題は幅広いですが，僕は主に輸送問題やスケジューリング問題に取り組んでいます。 もともと数学は得意ではなかったので，全然違う分野の研究室を志望していましたが，成績が死ぬほど悪く，第14志望の研究室への配属になってしまいました。 結果，苦手な数学と向き合い，研究する羽目になっております（結果的には良かったと思っています）。 趣味ガジェット集めが趣味で，色々買い漁っています。後悔も多いです…。 カメラもやってたりやってなかったりします。最近は撮りに行けてないですが，以前は三脚を担いで夜景を撮りに行ったりしていました。 中高とバドミントン部だったので，誘われればバドミントンもたまにやります。 おわりになるべく更新頻度多めに，面白いものや情報を発信していけたらなと思います。 どうぞよろしくお願い致します。","link":"/hotakahattori.github.io/2020/06/27/%E8%87%AA%E5%B7%B1%E7%B4%B9%E4%BB%8B/%E8%87%AA%E5%B7%B1%E7%B4%B9%E4%BB%8B/"},{"title":"test","text":"aaa","link":"/hotakahattori.github.io/2020/06/29/test/"}],"tags":[{"name":"数学","slug":"数学","link":"/hotakahattori.github.io/tags/%E6%95%B0%E5%AD%A6/"},{"name":"ガジェット","slug":"ガジェット","link":"/hotakahattori.github.io/tags/%E3%82%AC%E3%82%B8%E3%82%A7%E3%83%83%E3%83%88/"}],"categories":[{"name":"数学","slug":"数学","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/"},{"name":"ガジェット","slug":"ガジェット","link":"/hotakahattori.github.io/categories/%E3%82%AC%E3%82%B8%E3%82%A7%E3%83%83%E3%83%88/"},{"name":"数理最適化","slug":"数学/数理最適化","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/%E6%95%B0%E7%90%86%E6%9C%80%E9%81%A9%E5%8C%96/"},{"name":"オペレーションズ・リサーチ","slug":"数学/オペレーションズ・リサーチ","link":"/hotakahattori.github.io/categories/%E6%95%B0%E5%AD%A6/%E3%82%AA%E3%83%9A%E3%83%AC%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3%E3%82%BA%E3%83%BB%E3%83%AA%E3%82%B5%E3%83%BC%E3%83%81/"},{"name":"カメラ","slug":"カメラ","link":"/hotakahattori.github.io/categories/%E3%82%AB%E3%83%A1%E3%83%A9/"}]}